<?
include "../chksession.php";
if ($sess_table<>teacher) {
	header( "Location: ../index.html"); 	exit();}
?>
<html>
<? require "_header.php"; ?>

<center><h1>เกี่ยวกับฉัน</h1></center>
<br>     
<center><table border="0">
<tr>
      
      <td><label>
        <textarea cols="80" rows="22">
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;สืบเนื่องจากวิวัฒนาการทางด้านเทคโนโลยีสารสนเทศที่เข้ามามีบทบาทสำคัญนั้นทำให้คอมพิวเตอร์จึงเป็นส่วนหนึ่งที่เกี่ยวข้องกับชีวิตประจำวันของมนุษย์มากขึ้นในปัจจุบันและในการศึกษาด้านวิศวกรรมไฟฟ้า-อิเล็กทรอนิกส์  วิชา โปรแกรมภาษาซี ซึ่งเป็นวิชาที่นักศึกษาทุกคนต้องได้เรียนรู้เพื่อมีความรู้พื้นฐานในการเขียนโปรแกรม นักศึกษาที่ศึกษาด้านคอมพิวเตอร์โดยเฉพาะ นั้นจำเป็นอย่างยิ่งที่ต้องศึกษาการเขียนโปรแกรมภาษาซี และทำความเข้าใจที่ดี เพราะในปัจจุบันนักศึกษามีความต้องการที่จะเข้ามาศึกษาในสาขาคอมพิวเตอร์เพิ่มมากขึ้นเนื่องจากความรู้ทางด้านคอมพิวเตอร์ และ โปรแกรมคอมพิวเตอร์ เป็นที่ต้องการอย่างมากของตลาดแรงงานทั้งในและนอกประเทศ  ซึ่งการเขียนโปรแกรมภาษาซีเป็นพื้นฐานหลักของการเขียนโปรแกรมต่างๆ เช่น เกมส์ไปจนถึงแอพพลิเคชั่นต่างๆ ที่มีใช้กันทั่วไปมีทั้งในอุปกรณ์สื่อสารรวมไปจนถึงแอพพลิเคชั่นการใช้งานของเครื่องอัตโนมัติ ทั้งหลายเป็นต้น
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ดังนั้น ในการศึกษาวิชา โปรแกรมภาษาซี ของ วิทยาลัยเทคโนโลยีอุตสาหกรรม มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือสามารถที่จะนำเทคโนโลยีระบบเครือข่ายอินเทอร์เน็ตมาประยุกต์ใช้ในการเพิ่มทักษะการเขียนโปรแกรมภาษาซี โดยระบบ e-Learning นี้ส่วนมากยังคงเห็นในแบบภาคทฤษฎีที่มีไว้ศึกษากัน แล้วยังไม่ค่อยมีการนำมาทำเป็นภาคปฏิบัติ จึงได้มีแนวคิดที่จะสร้างแล้วพัฒนาเว็บไซต์และระบบขึ้นมา เพื่อใช้งานสำหรับการศึกษา การเขียนโปรแกรมภาษาซี  เพื่อให้นักเรียนนักศึกษาเรียนรู้การเขียนโปรแกรมภาษาซีได้ด้วยตนเอง โดยการเข้าไปศึกษาบทเรียนและทำแบบฝึกหัดที่สร้างขึ้น โดยจะเก็บข้อมูลการทำงานของนักศึกษาแต่ละครั้ง และทำให้อาจารย์ประจำวิชาหรือผู้ดูแลระบบสามารถควบคุมการทำแบบฝึกหัดของนักศึกษาได้  โดยใช้ระบบฐานข้อมูลในการทำงาน    
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;จากแนวคิดนี้คาดหวังว่าสื่อการสอนการเขียนโปรแกรมภาษาซีผ่านเว็บไซต์นี้จะช่วยให้ผู้เรียนสามารถพัฒนาการเขียนโปรแกรมภาษาซีได้ด้วยตนเอง โดยผ่านโปรแกรมที่สร้างขึ้นและเข้าไปทำแบบฝึกหัดและตรวจสอบคำตอบได้ด้วยตัวเอง  ยังช่วยแบ่งเบาภาระของอาจารย์ผู้สอนและผู้สอนยังสามารถแก้ไขหรือทำการเพิ่มแบบฝึกหัดแล้วยังควบคุมการทำงานนักศึกษาได้อีกด้วย อีกทั้งช่วยให้ผู้ที่เริ่มต้นเขียนโปรแกรมภาษาซีสามารถเข้าใจขั้นตอนการศึกษาของโปรแกรมภาษาซี ได้อย่างง่ายดาย

        </textarea>
      </label></td>
    </tr>
</table>
</center>  

<? require "_footer.php"; ?>
</html>
